4. Pandas

Pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.
The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas gives you answers about the data. Like:

Is there a correlation between two or more columns?
What is average value?
Max value?
Min value?

Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or NULL values. This is called cleaning the data.

In [45]:
# Let's get started with Pandas! 
# To begin, make sure you have installed pandas using Pip. Remember, we need to install every new package we use in our enviroment.

# Next we are going to import Pandas into our file and alias as pd.
import pandas as pd

In [46]:
# Now, let's bring in our test data

# We can use the read_csv function to bring in a csv file I have attached to the same folder as this python file
data = pd.read_csv('StudentData.csv')

# Let's see what we are dealing with. Print a small snippit of the data using the head method
print(data.head())

# This is a small table describing students who have just taken a 3 month exam, 1 exam written each month.

             Name   Age  Score Jan  Score Feb  Score Mar         Country  \
0   Dylan Sanders  21.0       56.0       84.0       27.0  United Kingdom
1   Dylan Sanders  32.0       38.0       22.0        1.0         America
2  Gabriel Routin  52.0       33.0       59.0       39.0    South Africa
3     Caleb Sheen  33.0       83.0       75.0       52.0       Australia
4    Aundry Smith  54.0       70.0       61.0       95.0         Germany

         Date
0  2023/09/01
1  2023/04/07
2  2023/06/06
3  2023/01/01
4  2023/01/19

In [47]:
# Using Pandas, we can get more information on how our data is structured. Quick and easy.

# print the table again, this time using the info method
print(data.info())

# This describes the individual fields in our table and their data types.
# If you look closely, you can also see we have 88 entries, 7 columns and that this is a dataframe object type.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       86 non-null     object
 1   Age        87 non-null     float64
 2   Score Jan  86 non-null     float64
 3   Score Feb  87 non-null     float64
 4   Score Mar  85 non-null     float64
 5   Country    85 non-null     object
 6   Date       88 non-null     object
dtypes: float64(4), object(3)
memory usage: 4.9+ KB
None

In [48]:
# While working with pandas, the main object type we will use is dataframes. 
# Dataframes are designed to display and work with tables in a very clear way, perfect for a data analyst

print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [49]:
# Let's fetch the last few records
print(data.tail())

              Name   Age  Score Jan  Score Feb  Score Mar         Country  \
83       Safa Lara  27.0       81.0       56.0       44.0       Australia
84             NaN   NaN        NaN        NaN        NaN             NaN
85  Subhaan Orozco  21.0       87.0       84.0       51.0  United Kingdom
86   Tatiana Walsh  24.0       46.0       57.0       73.0  United Kingdom
87    Alicia Watts  35.0       86.0       61.0       80.0  United Kingdom

          Date
83  2023/06/23
84  2023/08/18
85  2022/12/25
86  2022/12/17
87  2023/02/22

In [50]:
# Let's fetch the ages of our learners

# This is very simple to do, simply reference the field name in square brackets, following the dataframe name
age = data['Age']
print(age)

# This is a pandas series object type
print(type(age))

0     21.0
1     32.0
2     52.0
3     33.0
4     54.0
      ...
83    27.0
84     NaN
85    21.0
86    24.0
87    35.0
Name: Age, Length: 88, dtype: float64
<class 'pandas.core.series.Series'>

In [51]:
# We could use this field now to run some analysis
print('Average: ',age.mean())
print('Median: ',age.median())
print('Standard Deviation: ',age.std())
print('Min: ',age.min())
print('Max: ',age.max())

Average:  33.6551724137931
Median:  33.0
Standard Deviation:  10.085480683113856
Min:  19.0
Max:  56.0

In [52]:
# Another way we can investigate our data is by filtering our rows via operators

# We simply reference the field directly and add an operator after it, like below:
print(data['Age'] > 50)

# This returns a list of booleans for each record that matches our criteria

0     False
1     False
2      True
3     False
4      True
      ...
83    False
84    False
85    False
86    False
87    False
Name: Age, Length: 88, dtype: bool

In [53]:
# To return the entire rows that match our criteria, we can use the following:

# This is a unique syntax in python, but it makes sense once you write it, simply reference the dataframe
# Then put the same filter we used above, within square brackets. The boolean list we received in our
# previous example now becomes a filter for the table. 
overFifty = data[data['Age'] > 50]
print(overFifty)

                Name   Age  Score Jan  Score Feb  Score Mar        Country  \
2     Gabriel Routin  52.0       33.0       59.0       39.0   South Africa
4       Aundry Smith  54.0       70.0       61.0       95.0        Germany
5   Phillip Johonson  55.0       55.0       66.0       15.0  South America
6     Kevin Williams  56.0       98.0       52.0       92.0        Germany
16  Rachael Anderson  51.0       99.0       86.0       18.0      Australia
24       Paul kruger  54.0       81.0       84.0       41.0   South Africa
47        Amaan Odom  51.0       68.0       77.0       72.0      Australia
57       Omar Patton  56.0       68.0       55.0       58.0        Germany

          Date
2   2023/06/06
4   2023/01/19
5   2023/02/15
6   2023/03/23
16  2023/07/06
24  2022/12/18
47  2022/12/04
57  2023/07/04

In [54]:
# Let's play around with this for a few minutes

# Fetch all records where the learner is based in South Africa
southAfrica = data[data['Country'] == 'South Africa']
print(southAfrica)

               Name   Age  Score Jan  Score Feb  Score Mar       Country  \
2    Gabriel Routin  52.0       33.0       59.0       39.0  South Africa
7      Daniel Brown  33.0       92.0        5.0       82.0  South Africa
8      Justin Jones  43.0       86.0       51.0       38.0  South Africa
24      Paul kruger  54.0       81.0       84.0       41.0  South Africa
26       Peter Mier  42.0       44.0       57.0       63.0  South Africa
28       Janice Orr  25.0       80.0       84.0       50.0  South Africa
29   Mollie Perkins  26.0       85.0       62.0       82.0  South Africa
33  Roseanna Steele  31.0       56.0       48.0       39.0  South Africa
46    Eshal Mullins  31.0       85.0       46.0       45.0  South Africa
55      Myla Ingram  40.0       85.0       76.0       39.0  South Africa
59  Nannie Phillips  22.0       63.0       67.0       75.0  South Africa
64     Heath Church  28.0       67.0       41.0       85.0  South Africa
65       Ashton Cox  29.0        NaN       84.0       56.0  South Africa
66   Barbara Oliver  29.0       76.0       55.0       45.0  South Africa
81    Pedro Nielsen  39.0       55.0       62.0       82.0  South Africa

          Date
2   2023/06/06
7   2022/09/03
8   2023/06/18
24  2022/12/18
26  2023/07/19
28  2022/12/16
29  2022/11/18
33  2022/12/04
46  2023/05/26
55  2023/02/12
59  2023/03/27
64  2023/01/02
65  2023/06/21
66  2023/07/28
81  2023/06/19

In [55]:
# Fetch all records where the learner is NOT based in America
notAmerica = data[data['Country'] != 'America']
print(notAmerica)

                Name   Age  Score Jan  Score Feb  Score Mar         Country  \
0      Dylan Sanders  21.0       56.0       84.0       27.0  United Kingdom
2     Gabriel Routin  52.0       33.0       59.0       39.0    South Africa
3        Caleb Sheen  33.0       83.0       75.0       52.0       Australia
4       Aundry Smith  54.0       70.0       61.0       95.0         Germany
5   Phillip Johonson  55.0       55.0       66.0       15.0   South America
..               ...   ...        ...        ...        ...             ...
83         Safa Lara  27.0       81.0       56.0       44.0       Australia
84               NaN   NaN        NaN        NaN        NaN             NaN
85    Subhaan Orozco  21.0       87.0       84.0       51.0  United Kingdom
86     Tatiana Walsh  24.0       46.0       57.0       73.0  United Kingdom
87      Alicia Watts  35.0       86.0       61.0       80.0  United Kingdom

          Date
0   2023/09/01
2   2023/06/06
3   2023/01/01
4   2023/01/19
5   2023/02/15
..         ...
83  2023/06/23
84  2023/08/18
85  2022/12/25
86  2022/12/17
87  2023/02/22

[74 rows x 7 columns]

In [56]:
# Fetch all records where the learner is NOT based in America or South America

# If you want to filter by more than one condition, things get tricky.
# First, setup the base formula. For each condition, add a normal bracket within the square brackets. Then seperated by a & symbol

# data[() & ()]

# Simply put the usual filter within each of these brackets
notAmerica = data[(data['Country'] != 'America') & (data['Country'] != 'South America')]
print(notAmerica)

              Name   Age  Score Jan  Score Feb  Score Mar         Country  \
0    Dylan Sanders  21.0       56.0       84.0       27.0  United Kingdom
2   Gabriel Routin  52.0       33.0       59.0       39.0    South Africa
3      Caleb Sheen  33.0       83.0       75.0       52.0       Australia
4     Aundry Smith  54.0       70.0       61.0       95.0         Germany
6   Kevin Williams  56.0       98.0       52.0       92.0         Germany
..             ...   ...        ...        ...        ...             ...
83       Safa Lara  27.0       81.0       56.0       44.0       Australia
84             NaN   NaN        NaN        NaN        NaN             NaN
85  Subhaan Orozco  21.0       87.0       84.0       51.0  United Kingdom
86   Tatiana Walsh  24.0       46.0       57.0       73.0  United Kingdom
87    Alicia Watts  35.0       86.0       61.0       80.0  United Kingdom

          Date
0   2023/09/01
2   2023/06/06
3   2023/01/01
4   2023/01/19
6   2023/03/23
..         ...
83  2023/06/23
84  2023/08/18
85  2022/12/25
86  2022/12/17
87  2023/02/22

[64 rows x 7 columns]

In [57]:
# By now you've probably noticed, some of our data is in the wrong format. We need to repair it.
# This is called 'data clensing'

# Let's get a closer look at our data structure
print(data.head())
print(data.tail())

# Our numeric values are showing as floats. This will be the first thing we need to fix
# Some values are missing, we will need to either fill in the blanks or remove the records entirely
# Lastly, we have at least one duplicate we need to fix

             Name   Age  Score Jan  Score Feb  Score Mar         Country  \
0   Dylan Sanders  21.0       56.0       84.0       27.0  United Kingdom
1   Dylan Sanders  32.0       38.0       22.0        1.0         America
2  Gabriel Routin  52.0       33.0       59.0       39.0    South Africa
3     Caleb Sheen  33.0       83.0       75.0       52.0       Australia
4    Aundry Smith  54.0       70.0       61.0       95.0         Germany

         Date
0  2023/09/01
1  2023/04/07
2  2023/06/06
3  2023/01/01
4  2023/01/19
              Name   Age  Score Jan  Score Feb  Score Mar         Country  \
83       Safa Lara  27.0       81.0       56.0       44.0       Australia
84             NaN   NaN        NaN        NaN        NaN             NaN
85  Subhaan Orozco  21.0       87.0       84.0       51.0  United Kingdom
86   Tatiana Walsh  24.0       46.0       57.0       73.0  United Kingdom
87    Alicia Watts  35.0       86.0       61.0       80.0  United Kingdom

          Date
83  2023/06/23
84  2023/08/18
85  2022/12/25
86  2022/12/17
87  2023/02/22

In [58]:
# We have enough data to run analysis without having to repair the records with missing values
# Let's purge all recoreds where there are Null values

# To acheive this, we can use the dropna method
noNulls = data.dropna()
print(noNulls.head())
print(noNulls.tail())

             Name   Age  Score Jan  Score Feb  Score Mar         Country  \
0   Dylan Sanders  21.0       56.0       84.0       27.0  United Kingdom
1   Dylan Sanders  32.0       38.0       22.0        1.0         America
2  Gabriel Routin  52.0       33.0       59.0       39.0    South Africa
3     Caleb Sheen  33.0       83.0       75.0       52.0       Australia
4    Aundry Smith  54.0       70.0       61.0       95.0         Germany

         Date
0  2023/09/01
1  2023/04/07
2  2023/06/06
3  2023/01/01
4  2023/01/19
                Name   Age  Score Jan  Score Feb  Score Mar         Country  \
82  Youssef Atkinson  21.0       74.0       40.0       80.0  United Kingdom
83         Safa Lara  27.0       81.0       56.0       44.0       Australia
85    Subhaan Orozco  21.0       87.0       84.0       51.0  United Kingdom
86     Tatiana Walsh  24.0       46.0       57.0       73.0  United Kingdom
87      Alicia Watts  35.0       86.0       61.0       80.0  United Kingdom

          Date
82  2022/10/26
83  2023/06/23
85  2022/12/25
86  2022/12/17
87  2023/02/22

In [59]:
# By default, the dropna() method returns a new DataFrame, and will not change the original.
# If you want to update the original, we have to use the inplace parameter

# Using the inplace method does NOT allow us to return a new dataframe, so we won't assign a variable
data.dropna(inplace = True)

# Our data is now updated
print(data)

                Name   Age  Score Jan  Score Feb  Score Mar         Country  \
0      Dylan Sanders  21.0       56.0       84.0       27.0  United Kingdom
1      Dylan Sanders  32.0       38.0       22.0        1.0         America
2     Gabriel Routin  52.0       33.0       59.0       39.0    South Africa
3        Caleb Sheen  33.0       83.0       75.0       52.0       Australia
4       Aundry Smith  54.0       70.0       61.0       95.0         Germany
..               ...   ...        ...        ...        ...             ...
82  Youssef Atkinson  21.0       74.0       40.0       80.0  United Kingdom
83         Safa Lara  27.0       81.0       56.0       44.0       Australia
85    Subhaan Orozco  21.0       87.0       84.0       51.0  United Kingdom
86     Tatiana Walsh  24.0       46.0       57.0       73.0  United Kingdom
87      Alicia Watts  35.0       86.0       61.0       80.0  United Kingdom

          Date
0   2023/09/01
1   2023/04/07
2   2023/06/06
3   2023/01/01
4   2023/01/19
..         ...
82  2022/10/26
83  2023/06/23
85  2022/12/25
86  2022/12/17
87  2023/02/22

[81 rows x 7 columns]

In [60]:
# We could instead replace Null values with something else, if desired

data = pd.read_csv('StudentData.csv')
data.fillna(0, inplace=True)
print(data)

              Name   Age  Score Jan  Score Feb  Score Mar         Country  \
0    Dylan Sanders  21.0       56.0       84.0       27.0  United Kingdom
1    Dylan Sanders  32.0       38.0       22.0        1.0         America
2   Gabriel Routin  52.0       33.0       59.0       39.0    South Africa
3      Caleb Sheen  33.0       83.0       75.0       52.0       Australia
4     Aundry Smith  54.0       70.0       61.0       95.0         Germany
..             ...   ...        ...        ...        ...             ...
83       Safa Lara  27.0       81.0       56.0       44.0       Australia
84               0   0.0        0.0        0.0        0.0               0
85  Subhaan Orozco  21.0       87.0       84.0       51.0  United Kingdom
86   Tatiana Walsh  24.0       46.0       57.0       73.0  United Kingdom
87    Alicia Watts  35.0       86.0       61.0       80.0  United Kingdom

          Date
0   2023/09/01
1   2023/04/07
2   2023/06/06
3   2023/01/01
4   2023/01/19
..         ...
83  2023/06/23
84  2023/08/18
85  2022/12/25
86  2022/12/17
87  2023/02/22

[88 rows x 7 columns]

In [61]:
# But for now, let's just purge the empty records
data = pd.read_csv('StudentData.csv')
data.dropna(inplace = True)

In [62]:
# Let's move on to updating our formatting with each field. The datatype should be consistant

# Our numeric data has become floats, this is not acceptable
print(data.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81 entries, 0 to 87
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       81 non-null     object
 1   Age        81 non-null     float64
 2   Score Jan  81 non-null     float64
 3   Score Feb  81 non-null     float64
 4   Score Mar  81 non-null     float64
 5   Country    81 non-null     object
 6   Date       81 non-null     object
dtypes: float64(4), object(3)
memory usage: 5.1+ KB
None

In [63]:
# We will convert each field that is float into an int using the astype method

# We repeat this with each field. You should never have enough fields in a table to worry about repeating this extensibly.
data['Age'] = data['Age'].astype('int')
data['Score Jan'] = data['Score Jan'].astype('int')
data['Score Feb'] = data['Score Feb'].astype('int')
data['Score Mar'] = data['Score Mar'].astype('int')

# Now let's see the changes in effect
print(data.info())
print(data.head())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81 entries, 0 to 87
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       81 non-null     object
 1   Age        81 non-null     int32
 2   Score Jan  81 non-null     int32
 3   Score Feb  81 non-null     int32
 4   Score Mar  81 non-null     int32
 5   Country    81 non-null     object
 6   Date       81 non-null     object
dtypes: int32(4), object(3)
memory usage: 3.8+ KB
None
             Name  Age  Score Jan  Score Feb  Score Mar         Country  \
0   Dylan Sanders   21         56         84         27  United Kingdom
1   Dylan Sanders   32         38         22          1         America
2  Gabriel Routin   52         33         59         39    South Africa
3     Caleb Sheen   33         83         75         52       Australia
4    Aundry Smith   54         70         61         95         Germany

         Date
0  2023/09/01
1  2023/04/07
2  2023/06/06
3  2023/01/01
4  2023/01/19

In [64]:
# Lastly, let's fix that pesky duplicate. We will start by finding all records that are duplicated

# Using the duplicated method returns a list of True and False. True for records that are duplicated. We can use this
# to filter our dataframe by these records and display them.
duplicates = data['Name'].duplicated()
print(data[duplicates])

             Name  Age  Score Jan  Score Feb  Score Mar         Country  \
1   Dylan Sanders   32         38         22          1         America
13  Dylan Sanders   38         91         87         30  United Kingdom
18  Dylan Sanders   48         81          5         20  United Kingdom

          Date
1   2023/04/07
13  2023/06/11
18  2022/10/27

In [67]:
# These records are clearly wrong. Let's purge them.

data.drop_duplicates(subset= 'Name', inplace = True)

print(data.head())
print(data.tail())

               Name  Age  Score Jan  Score Feb  Score Mar         Country  \
0     Dylan Sanders   21         56         84         27  United Kingdom
2    Gabriel Routin   52         33         59         39    South Africa
3       Caleb Sheen   33         83         75         52       Australia
4      Aundry Smith   54         70         61         95         Germany
5  Phillip Johonson   55         55         66         15   South America

         Date
0  2023/09/01
2  2023/06/06
3  2023/01/01
4  2023/01/19
5  2023/02/15
                Name  Age  Score Jan  Score Feb  Score Mar         Country  \
82  Youssef Atkinson   21         74         40         80  United Kingdom
83         Safa Lara   27         81         56         44       Australia
85    Subhaan Orozco   21         87         84         51  United Kingdom
86     Tatiana Walsh   24         46         57         73  United Kingdom
87      Alicia Watts   35         86         61         80  United Kingdom

          Date
82  2022/10/26
83  2023/06/23
85  2022/12/25
86  2022/12/17
87  2023/02/22

In [66]:
# Finnaly our data is clean and ready for further analysis

print(data.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81 entries, 0 to 87
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       81 non-null     object
 1   Age        81 non-null     int32
 2   Score Jan  81 non-null     int32
 3   Score Feb  81 non-null     int32
 4   Score Mar  81 non-null     int32
 5   Country    81 non-null     object
 6   Date       81 non-null     object
dtypes: int32(4), object(3)
memory usage: 3.8+ KB
None